TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                           Unix v22.6.0.LTS *
       3              ;* Date/Time created: Thu Sep 21 22:05:20 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/Users/paiva/Documents/ti/motorware_1_01_00_18/sw/modules/hal/boards/dr
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen Unix v22.6.0.LTS Copyright (c) 1996
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/paiva/Documents/ti/motorware_1_01_00_18/sw/solutions/instasp
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   14718                      .dwattr $C$DW$1978, DW_AT_name("SPI_Mode_Master")
   14719                      .dwattr $C$DW$1978, DW_AT_const_value(0x04)
   14720              
   14721                      .dwendtag $C$DW$T$325
   14722              
   14723              $C$DW$T$326     .dwtag  DW_TAG_typedef
   14724                      .dwattr $C$DW$T$326, DW_AT_name("SPI_Mode_e")
   14725                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   14726                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   14727              
   14728              $C$DW$1979      .dwtag  DW_TAG_TI_far_type
   14729                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$326)
   14730              
   14731              $C$DW$T$327     .dwtag  DW_TAG_const_type
   14732                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$1979)
   14733              
   14734              
   14735              $C$DW$T$328     .dwtag  DW_TAG_enumeration_type
   14736                      .dwattr $C$DW$T$328, DW_AT_byte_size(0x01)
   14737              $C$DW$1980      .dwtag  DW_TAG_enumerator
   14738                      .dwattr $C$DW$1980, DW_AT_name("SPI_TxSuspend_00")
   14739                      .dwattr $C$DW$1980, DW_AT_const_value(0x00)
   14740              
   14741              $C$DW$1981      .dwtag  DW_TAG_enumerator
   14742                      .dwattr $C$DW$1981, DW_AT_name("SPI_TxSuspend_10")
   14743                      .dwattr $C$DW$1981, DW_AT_const_value(0x20)
   14744              
   14745              $C$DW$1982      .dwtag  DW_TAG_enumerator
   14746                      .dwattr $C$DW$1982, DW_AT_name("SPI_TxSuspend_free")
   14747                      .dwattr $C$DW$1982, DW_AT_const_value(0x10)
   14748              
   14749                      .dwendtag $C$DW$T$328
   14750              
   14751              $C$DW$T$329     .dwtag  DW_TAG_typedef
   14752                      .dwattr $C$DW$T$329, DW_AT_name("SPI_EmulationSuspend_e")
   14753                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
   14754                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   14755              
   14756              $C$DW$1983      .dwtag  DW_TAG_TI_far_type
   14757                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$329)
   14758              
   14759              $C$DW$T$330     .dwtag  DW_TAG_const_type
   14760                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1983)
   14761              
   14762              
   14763              $C$DW$T$331     .dwtag  DW_TAG_enumeration_type
   14764                      .dwattr $C$DW$T$331, DW_AT_byte_size(0x01)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  280

   14765              $C$DW$1984      .dwtag  DW_TAG_enumerator
   14766                      .dwattr $C$DW$1984, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   14767                      .dwattr $C$DW$1984, DW_AT_const_value(0x00)
   14768              
   14769              $C$DW$1985      .dwtag  DW_TAG_enumerator
   14770                      .dwattr $C$DW$1985, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   14771                      .dwattr $C$DW$1985, DW_AT_const_value(0x400)
   14772              
   14773              $C$DW$1986      .dwtag  DW_TAG_enumerator
   14774                      .dwattr $C$DW$1986, DW_AT_name("TIMER_EmulationMode_RunFree")
   14775                      .dwattr $C$DW$1986, DW_AT_const_value(0x800)
   14776              
   14777                      .dwendtag $C$DW$T$331
   14778              
   14779              $C$DW$T$332     .dwtag  DW_TAG_typedef
   14780                      .dwattr $C$DW$T$332, DW_AT_name("TIMER_EmulationMode_e")
   14781                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$331)
   14782                      .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   14783              
   14784              $C$DW$1987      .dwtag  DW_TAG_TI_far_type
   14785                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$332)
   14786              
   14787              $C$DW$T$333     .dwtag  DW_TAG_const_type
   14788                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$1987)
   14789              
   14790              
   14791              $C$DW$T$334     .dwtag  DW_TAG_enumeration_type
   14792                      .dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
   14793              $C$DW$1988      .dwtag  DW_TAG_enumerator
   14794                      .dwattr $C$DW$1988, DW_AT_name("HAL_SensorType_Current")
   14795                      .dwattr $C$DW$1988, DW_AT_const_value(0x00)
   14796              
   14797              $C$DW$1989      .dwtag  DW_TAG_enumerator
   14798                      .dwattr $C$DW$1989, DW_AT_name("HAL_SensorType_Voltage")
   14799                      .dwattr $C$DW$1989, DW_AT_const_value(0x01)
   14800              
   14801                      .dwendtag $C$DW$T$334
   14802              
   14803              $C$DW$T$335     .dwtag  DW_TAG_typedef
   14804                      .dwattr $C$DW$T$335, DW_AT_name("HAL_SensorType_e")
   14805                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   14806                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   14807              
   14808              
   14809              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   14810                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   14811                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   14812              $C$DW$1990      .dwtag  DW_TAG_member
   14813                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$24)
   14814                      .dwattr $C$DW$1990, DW_AT_name("ADCRESULT")
   14815                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_ADCRESULT")
   14816                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14817                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   14818              
   14819              $C$DW$1991      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  281

   14820                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$25)
   14821                      .dwattr $C$DW$1991, DW_AT_name("resvd_1")
   14822                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_resvd_1")
   14823                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14824                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   14825              
   14826              $C$DW$1992      .dwtag  DW_TAG_member
   14827                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$23)
   14828                      .dwattr $C$DW$1992, DW_AT_name("ADCCTL1")
   14829                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_ADCCTL1")
   14830                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   14831                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   14832              
   14833              $C$DW$1993      .dwtag  DW_TAG_member
   14834                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$23)
   14835                      .dwattr $C$DW$1993, DW_AT_name("ADCCTL2")
   14836                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_ADCCTL2")
   14837                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   14838                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   14839              
   14840              $C$DW$1994      .dwtag  DW_TAG_member
   14841                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$26)
   14842                      .dwattr $C$DW$1994, DW_AT_name("rsvd_2")
   14843                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_rsvd_2")
   14844                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   14845                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   14846              
   14847              $C$DW$1995      .dwtag  DW_TAG_member
   14848                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$23)
   14849                      .dwattr $C$DW$1995, DW_AT_name("ADCINTFLG")
   14850                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_ADCINTFLG")
   14851                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   14852                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   14853              
   14854              $C$DW$1996      .dwtag  DW_TAG_member
   14855                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$23)
   14856                      .dwattr $C$DW$1996, DW_AT_name("ADCINTFLGCLR")
   14857                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   14858                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   14859                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   14860              
   14861              $C$DW$1997      .dwtag  DW_TAG_member
   14862                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$23)
   14863                      .dwattr $C$DW$1997, DW_AT_name("ADCINTOVF")
   14864                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_ADCINTOVF")
   14865                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   14866                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   14867              
   14868              $C$DW$1998      .dwtag  DW_TAG_member
   14869                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$23)
   14870                      .dwattr $C$DW$1998, DW_AT_name("ADCINTOVFCLR")
   14871                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   14872                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   14873                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   14874              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  282

   14875              $C$DW$1999      .dwtag  DW_TAG_member
   14876                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$27)
   14877                      .dwattr $C$DW$1999, DW_AT_name("INTSELxNy")
   14878                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_INTSELxNy")
   14879                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   14880                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   14881              
   14882              $C$DW$2000      .dwtag  DW_TAG_member
   14883                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$28)
   14884                      .dwattr $C$DW$2000, DW_AT_name("rsvd_3")
   14885                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_rsvd_3")
   14886                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   14887                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   14888              
   14889              $C$DW$2001      .dwtag  DW_TAG_member
   14890                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$23)
   14891                      .dwattr $C$DW$2001, DW_AT_name("SOCPRICTRL")
   14892                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_SOCPRICTRL")
   14893                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   14894                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   14895              
   14896              $C$DW$2002      .dwtag  DW_TAG_member
   14897                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$23)
   14898                      .dwattr $C$DW$2002, DW_AT_name("rsvd_4")
   14899                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_rsvd_4")
   14900                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   14901                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   14902              
   14903              $C$DW$2003      .dwtag  DW_TAG_member
   14904                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$23)
   14905                      .dwattr $C$DW$2003, DW_AT_name("ADCSAMPLEMODE")
   14906                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   14907                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   14908                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   14909              
   14910              $C$DW$2004      .dwtag  DW_TAG_member
   14911                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$23)
   14912                      .dwattr $C$DW$2004, DW_AT_name("rsvd_5")
   14913                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_rsvd_5")
   14914                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   14915                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   14916              
   14917              $C$DW$2005      .dwtag  DW_TAG_member
   14918                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$23)
   14919                      .dwattr $C$DW$2005, DW_AT_name("ADCINTSOCSEL1")
   14920                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   14921                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   14922                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   14923              
   14924              $C$DW$2006      .dwtag  DW_TAG_member
   14925                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$23)
   14926                      .dwattr $C$DW$2006, DW_AT_name("ADCINTSOCSEL2")
   14927                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   14928                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   14929                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  283

   14930              
   14931              $C$DW$2007      .dwtag  DW_TAG_member
   14932                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$26)
   14933                      .dwattr $C$DW$2007, DW_AT_name("rsvd_6")
   14934                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_rsvd_6")
   14935                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   14936                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   14937              
   14938              $C$DW$2008      .dwtag  DW_TAG_member
   14939                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$23)
   14940                      .dwattr $C$DW$2008, DW_AT_name("ADCSOCFLG1")
   14941                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   14942                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   14943                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   14944              
   14945              $C$DW$2009      .dwtag  DW_TAG_member
   14946                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$23)
   14947                      .dwattr $C$DW$2009, DW_AT_name("rsvd_7")
   14948                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_rsvd_7")
   14949                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   14950                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   14951              
   14952              $C$DW$2010      .dwtag  DW_TAG_member
   14953                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$23)
   14954                      .dwattr $C$DW$2010, DW_AT_name("ADCSOCFRC1")
   14955                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   14956                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   14957                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   14958              
   14959              $C$DW$2011      .dwtag  DW_TAG_member
   14960                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$23)
   14961                      .dwattr $C$DW$2011, DW_AT_name("rsvd_8")
   14962                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_rsvd_8")
   14963                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   14964                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   14965              
   14966              $C$DW$2012      .dwtag  DW_TAG_member
   14967                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$23)
   14968                      .dwattr $C$DW$2012, DW_AT_name("ADCSOCOVF1")
   14969                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   14970                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   14971                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   14972              
   14973              $C$DW$2013      .dwtag  DW_TAG_member
   14974                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$23)
   14975                      .dwattr $C$DW$2013, DW_AT_name("rsvd_9")
   14976                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_rsvd_9")
   14977                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   14978                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   14979              
   14980              $C$DW$2014      .dwtag  DW_TAG_member
   14981                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$23)
   14982                      .dwattr $C$DW$2014, DW_AT_name("ADCSOCOVFCLR1")
   14983                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   14984                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  284

   14985                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   14986              
   14987              $C$DW$2015      .dwtag  DW_TAG_member
   14988                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$23)
   14989                      .dwattr $C$DW$2015, DW_AT_name("rsvd_10")
   14990                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_rsvd_10")
   14991                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   14992                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   14993              
   14994              $C$DW$2016      .dwtag  DW_TAG_member
   14995                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$24)
   14996                      .dwattr $C$DW$2016, DW_AT_name("ADCSOCxCTL")
   14997                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   14998                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   14999                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   15000              
   15001              $C$DW$2017      .dwtag  DW_TAG_member
   15002                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$24)
   15003                      .dwattr $C$DW$2017, DW_AT_name("rsvd_11")
   15004                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_rsvd_11")
   15005                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   15006                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   15007              
   15008              $C$DW$2018      .dwtag  DW_TAG_member
   15009                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$23)
   15010                      .dwattr $C$DW$2018, DW_AT_name("ADCREFTRIM")
   15011                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_ADCREFTRIM")
   15012                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   15013                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   15014              
   15015              $C$DW$2019      .dwtag  DW_TAG_member
   15016                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$23)
   15017                      .dwattr $C$DW$2019, DW_AT_name("ADCOFFTRIM")
   15018                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   15019                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   15020                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   15021              
   15022              $C$DW$2020      .dwtag  DW_TAG_member
   15023                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$29)
   15024                      .dwattr $C$DW$2020, DW_AT_name("resvd_12")
   15025                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_resvd_12")
   15026                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   15027                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   15028              
   15029              $C$DW$2021      .dwtag  DW_TAG_member
   15030                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$23)
   15031                      .dwattr $C$DW$2021, DW_AT_name("ADCREV")
   15032                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_ADCREV")
   15033                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   15034                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   15035              
   15036                      .dwendtag $C$DW$T$30
   15037              
   15038              $C$DW$T$337     .dwtag  DW_TAG_typedef
   15039                      .dwattr $C$DW$T$337, DW_AT_name("ADC_Obj")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  285

   15040                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$30)
   15041                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   15042              
   15043              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   15044                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   15045                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   15046              
   15047              $C$DW$T$89      .dwtag  DW_TAG_typedef
   15048                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   15049                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   15050                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   15051              
   15052              
   15053              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   15054                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   15055                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   15056              $C$DW$2022      .dwtag  DW_TAG_member
   15057                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$23)
   15058                      .dwattr $C$DW$2022, DW_AT_name("XCLK")
   15059                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_XCLK")
   15060                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15061                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   15062              
   15063              $C$DW$2023      .dwtag  DW_TAG_member
   15064                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$23)
   15065                      .dwattr $C$DW$2023, DW_AT_name("rsvd_1")
   15066                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_rsvd_1")
   15067                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15068                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   15069              
   15070              $C$DW$2024      .dwtag  DW_TAG_member
   15071                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$23)
   15072                      .dwattr $C$DW$2024, DW_AT_name("CLKCTL")
   15073                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_CLKCTL")
   15074                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15075                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   15076              
   15077              $C$DW$2025      .dwtag  DW_TAG_member
   15078                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$31)
   15079                      .dwattr $C$DW$2025, DW_AT_name("rsvd_2")
   15080                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_rsvd_2")
   15081                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15082                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   15083              
   15084              $C$DW$2026      .dwtag  DW_TAG_member
   15085                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$23)
   15086                      .dwattr $C$DW$2026, DW_AT_name("LOSPCP")
   15087                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_LOSPCP")
   15088                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15089                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   15090              
   15091              $C$DW$2027      .dwtag  DW_TAG_member
   15092                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$23)
   15093                      .dwattr $C$DW$2027, DW_AT_name("PCLKCR0")
   15094                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_PCLKCR0")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  286

   15095                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15096                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   15097              
   15098              $C$DW$2028      .dwtag  DW_TAG_member
   15099                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$23)
   15100                      .dwattr $C$DW$2028, DW_AT_name("PCLKCR1")
   15101                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_PCLKCR1")
   15102                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15103                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   15104              
   15105              $C$DW$2029      .dwtag  DW_TAG_member
   15106                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$26)
   15107                      .dwattr $C$DW$2029, DW_AT_name("rsvd_3")
   15108                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_rsvd_3")
   15109                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15110                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   15111              
   15112              $C$DW$2030      .dwtag  DW_TAG_member
   15113                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$23)
   15114                      .dwattr $C$DW$2030, DW_AT_name("PCLKCR3")
   15115                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_PCLKCR3")
   15116                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15117                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   15118              
   15119                      .dwendtag $C$DW$T$32
   15120              
   15121              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   15122                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   15123                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   15124              
   15125              $C$DW$T$91      .dwtag  DW_TAG_typedef
   15126                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   15127                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   15128                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   15129              
   15130              
   15131              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   15132                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   15133                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   15134              $C$DW$2031      .dwtag  DW_TAG_member
   15135                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$34)
   15136                      .dwattr $C$DW$2031, DW_AT_name("tmp")
   15137                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_tmp")
   15138                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15139                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   15140              
   15141                      .dwendtag $C$DW$T$35
   15142              
   15143              $C$DW$T$346     .dwtag  DW_TAG_typedef
   15144                      .dwattr $C$DW$T$346, DW_AT_name("CPU_Obj")
   15145                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$35)
   15146                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   15147              
   15148              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   15149                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  287

   15150                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   15151              
   15152              $C$DW$T$93      .dwtag  DW_TAG_typedef
   15153                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   15154                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   15155                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   15156              
   15157              
   15158              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   15159                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   15160                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   15161              $C$DW$2032      .dwtag  DW_TAG_member
   15162                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$37)
   15163                      .dwattr $C$DW$2032, DW_AT_name("spiHandle")
   15164                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_spiHandle")
   15165                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15166                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   15167              
   15168              $C$DW$2033      .dwtag  DW_TAG_member
   15169                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$39)
   15170                      .dwattr $C$DW$2033, DW_AT_name("gpioHandle")
   15171                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_gpioHandle")
   15172                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15173                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   15174              
   15175              $C$DW$2034      .dwtag  DW_TAG_member
   15176                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$41)
   15177                      .dwattr $C$DW$2034, DW_AT_name("gpioNumber")
   15178                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_gpioNumber")
   15179                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15180                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   15181              
   15182              $C$DW$2035      .dwtag  DW_TAG_member
   15183                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$42)
   15184                      .dwattr $C$DW$2035, DW_AT_name("RxTimeOut")
   15185                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_RxTimeOut")
   15186                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15187                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   15188              
   15189              $C$DW$2036      .dwtag  DW_TAG_member
   15190                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$42)
   15191                      .dwattr $C$DW$2036, DW_AT_name("enableTimeOut")
   15192                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_enableTimeOut")
   15193                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15194                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
   15195              
   15196                      .dwendtag $C$DW$T$43
   15197              
   15198              $C$DW$T$120     .dwtag  DW_TAG_typedef
   15199                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   15200                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   15201                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   15202              
   15203              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   15204                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  288

   15205                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   15206              
   15207              $C$DW$T$119     .dwtag  DW_TAG_typedef
   15208                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   15209                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   15210                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   15211              
   15212              
   15213              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   15214                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   15215                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   15216              $C$DW$2037      .dwtag  DW_TAG_member
   15217                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$45)
   15218                      .dwattr $C$DW$2037, DW_AT_name("DRV8301_CURRENT")
   15219                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   15220                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15221                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   15222              
   15223              $C$DW$2038      .dwtag  DW_TAG_member
   15224                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$47)
   15225                      .dwattr $C$DW$2038, DW_AT_name("DRV8301_RESET")
   15226                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_DRV8301_RESET")
   15227                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15228                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   15229              
   15230              $C$DW$2039      .dwtag  DW_TAG_member
   15231                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$49)
   15232                      .dwattr $C$DW$2039, DW_AT_name("PWM_MODE")
   15233                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_PWM_MODE")
   15234                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15235                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   15236              
   15237              $C$DW$2040      .dwtag  DW_TAG_member
   15238                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$51)
   15239                      .dwattr $C$DW$2040, DW_AT_name("OC_MODE")
   15240                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_OC_MODE")
   15241                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15242                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   15243              
   15244              $C$DW$2041      .dwtag  DW_TAG_member
   15245                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$53)
   15246                      .dwattr $C$DW$2041, DW_AT_name("OC_ADJ_SET")
   15247                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   15248                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15249                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   15250              
   15251                      .dwendtag $C$DW$T$54
   15252              
   15253              $C$DW$T$68      .dwtag  DW_TAG_typedef
   15254                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   15255                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   15256                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   15257              
   15258              
   15259              $C$DW$T$63      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  289

   15260                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   15261                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   15262              $C$DW$2042      .dwtag  DW_TAG_member
   15263                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$56)
   15264                      .dwattr $C$DW$2042, DW_AT_name("OCTW_SET")
   15265                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_OCTW_SET")
   15266                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15267                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   15268              
   15269              $C$DW$2043      .dwtag  DW_TAG_member
   15270                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$58)
   15271                      .dwattr $C$DW$2043, DW_AT_name("GAIN")
   15272                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_GAIN")
   15273                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15274                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   15275              
   15276              $C$DW$2044      .dwtag  DW_TAG_member
   15277                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$60)
   15278                      .dwattr $C$DW$2044, DW_AT_name("DC_CAL_CH1p2")
   15279                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   15280                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15281                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   15282              
   15283              $C$DW$2045      .dwtag  DW_TAG_member
   15284                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$62)
   15285                      .dwattr $C$DW$2045, DW_AT_name("OC_TOFF")
   15286                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_OC_TOFF")
   15287                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15288                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   15289              
   15290                      .dwendtag $C$DW$T$63
   15291              
   15292              $C$DW$T$69      .dwtag  DW_TAG_typedef
   15293                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   15294                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   15295                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   15296              
   15297              
   15298              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   15299                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   15300                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   15301              $C$DW$2046      .dwtag  DW_TAG_member
   15302                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$42)
   15303                      .dwattr $C$DW$2046, DW_AT_name("FAULT")
   15304                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_FAULT")
   15305                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15306                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   15307              
   15308              $C$DW$2047      .dwtag  DW_TAG_member
   15309                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$42)
   15310                      .dwattr $C$DW$2047, DW_AT_name("GVDD_UV")
   15311                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_GVDD_UV")
   15312                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15313                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   15314              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  290

   15315              $C$DW$2048      .dwtag  DW_TAG_member
   15316                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$42)
   15317                      .dwattr $C$DW$2048, DW_AT_name("PVDD_UV")
   15318                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_PVDD_UV")
   15319                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15320                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   15321              
   15322              $C$DW$2049      .dwtag  DW_TAG_member
   15323                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$42)
   15324                      .dwattr $C$DW$2049, DW_AT_name("OTSD")
   15325                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_OTSD")
   15326                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15327                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   15328              
   15329              $C$DW$2050      .dwtag  DW_TAG_member
   15330                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$42)
   15331                      .dwattr $C$DW$2050, DW_AT_name("OTW")
   15332                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_OTW")
   15333                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15334                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   15335              
   15336              $C$DW$2051      .dwtag  DW_TAG_member
   15337                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$42)
   15338                      .dwattr $C$DW$2051, DW_AT_name("FETHA_OC")
   15339                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_FETHA_OC")
   15340                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15341                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   15342              
   15343              $C$DW$2052      .dwtag  DW_TAG_member
   15344                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$42)
   15345                      .dwattr $C$DW$2052, DW_AT_name("FETLA_OC")
   15346                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_FETLA_OC")
   15347                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15348                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   15349              
   15350              $C$DW$2053      .dwtag  DW_TAG_member
   15351                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$42)
   15352                      .dwattr $C$DW$2053, DW_AT_name("FETHB_OC")
   15353                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_FETHB_OC")
   15354                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15355                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   15356              
   15357              $C$DW$2054      .dwtag  DW_TAG_member
   15358                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$42)
   15359                      .dwattr $C$DW$2054, DW_AT_name("FETLB_OC")
   15360                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_FETLB_OC")
   15361                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15362                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   15363              
   15364              $C$DW$2055      .dwtag  DW_TAG_member
   15365                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$42)
   15366                      .dwattr $C$DW$2055, DW_AT_name("FETHC_OC")
   15367                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_FETHC_OC")
   15368                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   15369                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  291

   15370              
   15371              $C$DW$2056      .dwtag  DW_TAG_member
   15372                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$42)
   15373                      .dwattr $C$DW$2056, DW_AT_name("FETLC_OC")
   15374                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_FETLC_OC")
   15375                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15376                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   15377              
   15378                      .dwendtag $C$DW$T$64
   15379              
   15380              $C$DW$T$66      .dwtag  DW_TAG_typedef
   15381                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   15382                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   15383                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   15384              
   15385              
   15386              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   15387                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   15388                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   15389              $C$DW$2057      .dwtag  DW_TAG_member
   15390                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$42)
   15391                      .dwattr $C$DW$2057, DW_AT_name("GVDD_OV")
   15392                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_GVDD_OV")
   15393                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15394                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   15395              
   15396              $C$DW$2058      .dwtag  DW_TAG_member
   15397                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$22)
   15398                      .dwattr $C$DW$2058, DW_AT_name("DeviceID")
   15399                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_DeviceID")
   15400                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15401                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   15402              
   15403                      .dwendtag $C$DW$T$65
   15404              
   15405              $C$DW$T$67      .dwtag  DW_TAG_typedef
   15406                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   15407                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   15408                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15409              
   15410              
   15411              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   15412                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   15413                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   15414              $C$DW$2059      .dwtag  DW_TAG_member
   15415                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$66)
   15416                      .dwattr $C$DW$2059, DW_AT_name("Stat_Reg_1")
   15417                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_Stat_Reg_1")
   15418                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15419                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   15420              
   15421              $C$DW$2060      .dwtag  DW_TAG_member
   15422                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$67)
   15423                      .dwattr $C$DW$2060, DW_AT_name("Stat_Reg_2")
   15424                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_Stat_Reg_2")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  292

   15425                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15426                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   15427              
   15428              $C$DW$2061      .dwtag  DW_TAG_member
   15429                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$68)
   15430                      .dwattr $C$DW$2061, DW_AT_name("Ctrl_Reg_1")
   15431                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   15432                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15433                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   15434              
   15435              $C$DW$2062      .dwtag  DW_TAG_member
   15436                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$69)
   15437                      .dwattr $C$DW$2062, DW_AT_name("Ctrl_Reg_2")
   15438                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   15439                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15440                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   15441              
   15442              $C$DW$2063      .dwtag  DW_TAG_member
   15443                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$42)
   15444                      .dwattr $C$DW$2063, DW_AT_name("SndCmd")
   15445                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_SndCmd")
   15446                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15447                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   15448              
   15449              $C$DW$2064      .dwtag  DW_TAG_member
   15450                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$42)
   15451                      .dwattr $C$DW$2064, DW_AT_name("RcvCmd")
   15452                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_RcvCmd")
   15453                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   15454                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   15455              
   15456                      .dwendtag $C$DW$T$70
   15457              
   15458              $C$DW$T$353     .dwtag  DW_TAG_typedef
   15459                      .dwattr $C$DW$T$353, DW_AT_name("DRV_SPI_8301_Vars_t")
   15460                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$70)
   15461                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   15462              
   15463              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   15464                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   15465                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   15466              
   15467              
   15468              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   15469                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   15470                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   15471              $C$DW$2065      .dwtag  DW_TAG_member
   15472                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$71)
   15473                      .dwattr $C$DW$2065, DW_AT_name("a1")
   15474                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_a1")
   15475                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15476                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   15477              
   15478              $C$DW$2066      .dwtag  DW_TAG_member
   15479                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  293

   15480                      .dwattr $C$DW$2066, DW_AT_name("b0")
   15481                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_b0")
   15482                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15483                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   15484              
   15485              $C$DW$2067      .dwtag  DW_TAG_member
   15486                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$71)
   15487                      .dwattr $C$DW$2067, DW_AT_name("b1")
   15488                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_b1")
   15489                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15490                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   15491              
   15492              $C$DW$2068      .dwtag  DW_TAG_member
   15493                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$71)
   15494                      .dwattr $C$DW$2068, DW_AT_name("x1")
   15495                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_x1")
   15496                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15497                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   15498              
   15499              $C$DW$2069      .dwtag  DW_TAG_member
   15500                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$71)
   15501                      .dwattr $C$DW$2069, DW_AT_name("y1")
   15502                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_y1")
   15503                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15504                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
   15505              
   15506                      .dwendtag $C$DW$T$72
   15507              
   15508              $C$DW$T$124     .dwtag  DW_TAG_typedef
   15509                      .dwattr $C$DW$T$124, DW_AT_name("FILTER_FO_Obj")
   15510                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$72)
   15511                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   15512              
   15513              
   15514              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   15515                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   15516                      .dwattr $C$DW$T$19, DW_AT_declaration
   15517                      .dwendtag $C$DW$T$19
   15518              
   15519              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
   15520                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$19)
   15521                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
   15522              
   15523              $C$DW$T$126     .dwtag  DW_TAG_typedef
   15524                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Handle")
   15525                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
   15526                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   15527              
   15528              
   15529              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   15530                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   15531                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   15532              $C$DW$2070      .dwtag  DW_TAG_member
   15533                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$23)
   15534                      .dwattr $C$DW$2070, DW_AT_name("FOPT")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  294

   15535                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_FOPT")
   15536                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15537                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   15538              
   15539              $C$DW$2071      .dwtag  DW_TAG_member
   15540                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$23)
   15541                      .dwattr $C$DW$2071, DW_AT_name("rsvd_1")
   15542                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_rsvd_1")
   15543                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15544                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   15545              
   15546              $C$DW$2072      .dwtag  DW_TAG_member
   15547                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$23)
   15548                      .dwattr $C$DW$2072, DW_AT_name("FPWR")
   15549                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_FPWR")
   15550                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15551                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   15552              
   15553              $C$DW$2073      .dwtag  DW_TAG_member
   15554                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$23)
   15555                      .dwattr $C$DW$2073, DW_AT_name("FSTATUS")
   15556                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_FSTATUS")
   15557                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15558                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   15559              
   15560              $C$DW$2074      .dwtag  DW_TAG_member
   15561                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$23)
   15562                      .dwattr $C$DW$2074, DW_AT_name("FSTDBYWAIT")
   15563                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   15564                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15565                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   15566              
   15567              $C$DW$2075      .dwtag  DW_TAG_member
   15568                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$23)
   15569                      .dwattr $C$DW$2075, DW_AT_name("FACTIVEWAIT")
   15570                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   15571                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15572                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   15573              
   15574              $C$DW$2076      .dwtag  DW_TAG_member
   15575                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$23)
   15576                      .dwattr $C$DW$2076, DW_AT_name("FBANKWAIT")
   15577                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_FBANKWAIT")
   15578                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15579                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   15580              
   15581              $C$DW$2077      .dwtag  DW_TAG_member
   15582                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$23)
   15583                      .dwattr $C$DW$2077, DW_AT_name("FOTPWAIT")
   15584                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_FOTPWAIT")
   15585                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15586                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   15587              
   15588                      .dwendtag $C$DW$T$73
   15589              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  295

   15590              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   15591                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   15592                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   15593              
   15594              $C$DW$T$95      .dwtag  DW_TAG_typedef
   15595                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   15596                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   15597                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   15598              
   15599              
   15600              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   15601                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   15602                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   15603              $C$DW$2078      .dwtag  DW_TAG_member
   15604                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$76)
   15605                      .dwattr $C$DW$2078, DW_AT_name("GPACTRL")
   15606                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_GPACTRL")
   15607                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15608                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   15609              
   15610              $C$DW$2079      .dwtag  DW_TAG_member
   15611                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$76)
   15612                      .dwattr $C$DW$2079, DW_AT_name("GPAQSEL1")
   15613                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_GPAQSEL1")
   15614                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15615                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   15616              
   15617              $C$DW$2080      .dwtag  DW_TAG_member
   15618                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$76)
   15619                      .dwattr $C$DW$2080, DW_AT_name("GPAQSEL2")
   15620                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_GPAQSEL2")
   15621                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15622                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   15623              
   15624              $C$DW$2081      .dwtag  DW_TAG_member
   15625                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$76)
   15626                      .dwattr $C$DW$2081, DW_AT_name("GPAMUX1")
   15627                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_GPAMUX1")
   15628                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15629                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   15630              
   15631              $C$DW$2082      .dwtag  DW_TAG_member
   15632                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$76)
   15633                      .dwattr $C$DW$2082, DW_AT_name("GPAMUX2")
   15634                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_GPAMUX2")
   15635                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15636                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
   15637              
   15638              $C$DW$2083      .dwtag  DW_TAG_member
   15639                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$76)
   15640                      .dwattr $C$DW$2083, DW_AT_name("GPADIR")
   15641                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_GPADIR")
   15642                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15643                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   15644              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  296

   15645              $C$DW$2084      .dwtag  DW_TAG_member
   15646                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$76)
   15647                      .dwattr $C$DW$2084, DW_AT_name("GPAPUD")
   15648                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_GPAPUD")
   15649                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15650                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   15651              
   15652              $C$DW$2085      .dwtag  DW_TAG_member
   15653                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$26)
   15654                      .dwattr $C$DW$2085, DW_AT_name("rsvd_1")
   15655                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_rsvd_1")
   15656                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15657                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   15658              
   15659              $C$DW$2086      .dwtag  DW_TAG_member
   15660                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$76)
   15661                      .dwattr $C$DW$2086, DW_AT_name("GPBCTRL")
   15662                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_GPBCTRL")
   15663                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15664                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   15665              
   15666              $C$DW$2087      .dwtag  DW_TAG_member
   15667                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$76)
   15668                      .dwattr $C$DW$2087, DW_AT_name("GPBQSEL1")
   15669                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_GPBQSEL1")
   15670                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15671                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   15672              
   15673              $C$DW$2088      .dwtag  DW_TAG_member
   15674                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$76)
   15675                      .dwattr $C$DW$2088, DW_AT_name("GPBQSEL2")
   15676                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_GPBQSEL2")
   15677                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15678                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   15679              
   15680              $C$DW$2089      .dwtag  DW_TAG_member
   15681                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$76)
   15682                      .dwattr $C$DW$2089, DW_AT_name("GPBMUX1")
   15683                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_GPBMUX1")
   15684                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15685                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   15686              
   15687              $C$DW$2090      .dwtag  DW_TAG_member
   15688                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$76)
   15689                      .dwattr $C$DW$2090, DW_AT_name("GPBMUX2")
   15690                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_GPBMUX2")
   15691                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15692                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   15693              
   15694              $C$DW$2091      .dwtag  DW_TAG_member
   15695                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$76)
   15696                      .dwattr $C$DW$2091, DW_AT_name("GPBDIR")
   15697                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_GPBDIR")
   15698                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15699                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  297

   15700              
   15701              $C$DW$2092      .dwtag  DW_TAG_member
   15702                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$76)
   15703                      .dwattr $C$DW$2092, DW_AT_name("GPBPUD")
   15704                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_GPBPUD")
   15705                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15706                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   15707              
   15708              $C$DW$2093      .dwtag  DW_TAG_member
   15709                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$77)
   15710                      .dwattr $C$DW$2093, DW_AT_name("rsvd_4")
   15711                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_rsvd_4")
   15712                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   15713                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   15714              
   15715              $C$DW$2094      .dwtag  DW_TAG_member
   15716                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$76)
   15717                      .dwattr $C$DW$2094, DW_AT_name("AIOMUX1")
   15718                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_AIOMUX1")
   15719                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   15720                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   15721              
   15722              $C$DW$2095      .dwtag  DW_TAG_member
   15723                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$26)
   15724                      .dwattr $C$DW$2095, DW_AT_name("rsvd_5")
   15725                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_rsvd_5")
   15726                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   15727                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   15728              
   15729              $C$DW$2096      .dwtag  DW_TAG_member
   15730                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$76)
   15731                      .dwattr $C$DW$2096, DW_AT_name("AIODIR")
   15732                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_AIODIR")
   15733                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   15734                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   15735              
   15736              $C$DW$2097      .dwtag  DW_TAG_member
   15737                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$78)
   15738                      .dwattr $C$DW$2097, DW_AT_name("rsvd_6")
   15739                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_rsvd_6")
   15740                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   15741                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   15742              
   15743              $C$DW$2098      .dwtag  DW_TAG_member
   15744                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$76)
   15745                      .dwattr $C$DW$2098, DW_AT_name("GPADAT")
   15746                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_GPADAT")
   15747                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   15748                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   15749              
   15750              $C$DW$2099      .dwtag  DW_TAG_member
   15751                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$76)
   15752                      .dwattr $C$DW$2099, DW_AT_name("GPASET")
   15753                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_GPASET")
   15754                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  298

   15755                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   15756              
   15757              $C$DW$2100      .dwtag  DW_TAG_member
   15758                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$76)
   15759                      .dwattr $C$DW$2100, DW_AT_name("GPACLEAR")
   15760                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_GPACLEAR")
   15761                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   15762                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
   15763              
   15764              $C$DW$2101      .dwtag  DW_TAG_member
   15765                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$76)
   15766                      .dwattr $C$DW$2101, DW_AT_name("GPATOGGLE")
   15767                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_GPATOGGLE")
   15768                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15769                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
   15770              
   15771              $C$DW$2102      .dwtag  DW_TAG_member
   15772                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$76)
   15773                      .dwattr $C$DW$2102, DW_AT_name("GPBDAT")
   15774                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_GPBDAT")
   15775                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   15776                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   15777              
   15778              $C$DW$2103      .dwtag  DW_TAG_member
   15779                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$76)
   15780                      .dwattr $C$DW$2103, DW_AT_name("GPBSET")
   15781                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_GPBSET")
   15782                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   15783                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   15784              
   15785              $C$DW$2104      .dwtag  DW_TAG_member
   15786                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$76)
   15787                      .dwattr $C$DW$2104, DW_AT_name("GPBCLEAR")
   15788                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_GPBCLEAR")
   15789                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   15790                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   15791              
   15792              $C$DW$2105      .dwtag  DW_TAG_member
   15793                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$76)
   15794                      .dwattr $C$DW$2105, DW_AT_name("GPBTOGGLE")
   15795                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_GPBTOGGLE")
   15796                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   15797                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   15798              
   15799              $C$DW$2106      .dwtag  DW_TAG_member
   15800                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$31)
   15801                      .dwattr $C$DW$2106, DW_AT_name("rsvd_7")
   15802                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_rsvd_7")
   15803                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   15804                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
   15805              
   15806              $C$DW$2107      .dwtag  DW_TAG_member
   15807                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$76)
   15808                      .dwattr $C$DW$2107, DW_AT_name("AIODAT")
   15809                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_AIODAT")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  299

   15810                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   15811                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   15812              
   15813              $C$DW$2108      .dwtag  DW_TAG_member
   15814                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$76)
   15815                      .dwattr $C$DW$2108, DW_AT_name("AIOSET")
   15816                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_AIOSET")
   15817                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   15818                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   15819              
   15820              $C$DW$2109      .dwtag  DW_TAG_member
   15821                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$76)
   15822                      .dwattr $C$DW$2109, DW_AT_name("AIOCLEAR")
   15823                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_AIOCLEAR")
   15824                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   15825                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   15826              
   15827              $C$DW$2110      .dwtag  DW_TAG_member
   15828                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$76)
   15829                      .dwattr $C$DW$2110, DW_AT_name("AIOTOGGLE")
   15830                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_AIOTOGGLE")
   15831                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   15832                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   15833              
   15834              $C$DW$2111      .dwtag  DW_TAG_member
   15835                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$28)
   15836                      .dwattr $C$DW$2111, DW_AT_name("GPIOXINTnSEL")
   15837                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   15838                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   15839                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   15840              
   15841              $C$DW$2112      .dwtag  DW_TAG_member
   15842                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$27)
   15843                      .dwattr $C$DW$2112, DW_AT_name("rsvd_8")
   15844                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_rsvd_8")
   15845                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   15846                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   15847              
   15848              $C$DW$2113      .dwtag  DW_TAG_member
   15849                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$76)
   15850                      .dwattr $C$DW$2113, DW_AT_name("GPIOLPMSEL")
   15851                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   15852                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   15853                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   15854              
   15855                      .dwendtag $C$DW$T$79
   15856              
   15857              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   15858                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   15859                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   15860              
   15861              $C$DW$T$39      .dwtag  DW_TAG_typedef
   15862                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   15863                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   15864                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  300

   15865              
   15866              
   15867              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   15868                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   15869                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   15870              $C$DW$2114      .dwtag  DW_TAG_member
   15871                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$80)
   15872                      .dwattr $C$DW$2114, DW_AT_name("I")
   15873                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_I")
   15874                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15875                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   15876              
   15877              $C$DW$2115      .dwtag  DW_TAG_member
   15878                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$80)
   15879                      .dwattr $C$DW$2115, DW_AT_name("V")
   15880                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_V")
   15881                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15882                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   15883              
   15884              $C$DW$2116      .dwtag  DW_TAG_member
   15885                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$71)
   15886                      .dwattr $C$DW$2116, DW_AT_name("dcBus")
   15887                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_dcBus")
   15888                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15889                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
   15890              
   15891                      .dwendtag $C$DW$T$81
   15892              
   15893              $C$DW$T$117     .dwtag  DW_TAG_typedef
   15894                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   15895                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   15896                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   15897              
   15898              
   15899              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   15900                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   15901                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   15902              $C$DW$2117      .dwtag  DW_TAG_member
   15903                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$22)
   15904                      .dwattr $C$DW$2117, DW_AT_name("PeriodMax")
   15905                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_PeriodMax")
   15906                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15907                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
   15908              
   15909              $C$DW$2118      .dwtag  DW_TAG_member
   15910                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$85)
   15911                      .dwattr $C$DW$2118, DW_AT_name("ptrData")
   15912                      .dwattr $C$DW$2118, DW_AT_TI_symbol_name("_ptrData")
   15913                      .dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15914                      .dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
   15915              
   15916              $C$DW$2119      .dwtag  DW_TAG_member
   15917                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$86)
   15918                      .dwattr $C$DW$2119, DW_AT_name("value")
   15919                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  301

   15920                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15921                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   15922              
   15923              $C$DW$2120      .dwtag  DW_TAG_member
   15924                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$86)
   15925                      .dwattr $C$DW$2120, DW_AT_name("offset")
   15926                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_offset")
   15927                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15928                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   15929              
   15930              $C$DW$2121      .dwtag  DW_TAG_member
   15931                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$86)
   15932                      .dwattr $C$DW$2121, DW_AT_name("gain")
   15933                      .dwattr $C$DW$2121, DW_AT_TI_symbol_name("_gain")
   15934                      .dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15935                      .dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
   15936              
   15937                      .dwendtag $C$DW$T$87
   15938              
   15939              $C$DW$T$364     .dwtag  DW_TAG_typedef
   15940                      .dwattr $C$DW$T$364, DW_AT_name("HAL_DacData_t")
   15941                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$87)
   15942                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   15943              
   15944              $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   15945                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   15946                      .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   15947              
   15948              $C$DW$2122      .dwtag  DW_TAG_TI_far_type
   15949                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$365)
   15950              
   15951              $C$DW$T$366     .dwtag  DW_TAG_const_type
   15952                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$2122)
   15953              
   15954              
   15955              $C$DW$T$121     .dwtag  DW_TAG_structure_type
   15956                      .dwattr $C$DW$T$121, DW_AT_name("_HAL_Obj_")
   15957                      .dwattr $C$DW$T$121, DW_AT_byte_size(0xa8)
   15958              $C$DW$2123      .dwtag  DW_TAG_member
   15959                      .dwattr $C$DW$2123, DW_AT_type(*$C$DW$T$89)
   15960                      .dwattr $C$DW$2123, DW_AT_name("adcHandle")
   15961                      .dwattr $C$DW$2123, DW_AT_TI_symbol_name("_adcHandle")
   15962                      .dwattr $C$DW$2123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15963                      .dwattr $C$DW$2123, DW_AT_accessibility(DW_ACCESS_public)
   15964              
   15965              $C$DW$2124      .dwtag  DW_TAG_member
   15966                      .dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$91)
   15967                      .dwattr $C$DW$2124, DW_AT_name("clkHandle")
   15968                      .dwattr $C$DW$2124, DW_AT_TI_symbol_name("_clkHandle")
   15969                      .dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15970                      .dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
   15971              
   15972              $C$DW$2125      .dwtag  DW_TAG_member
   15973                      .dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$93)
   15974                      .dwattr $C$DW$2125, DW_AT_name("cpuHandle")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  302

   15975                      .dwattr $C$DW$2125, DW_AT_TI_symbol_name("_cpuHandle")
   15976                      .dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15977                      .dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
   15978              
   15979              $C$DW$2126      .dwtag  DW_TAG_member
   15980                      .dwattr $C$DW$2126, DW_AT_type(*$C$DW$T$95)
   15981                      .dwattr $C$DW$2126, DW_AT_name("flashHandle")
   15982                      .dwattr $C$DW$2126, DW_AT_TI_symbol_name("_flashHandle")
   15983                      .dwattr $C$DW$2126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15984                      .dwattr $C$DW$2126, DW_AT_accessibility(DW_ACCESS_public)
   15985              
   15986              $C$DW$2127      .dwtag  DW_TAG_member
   15987                      .dwattr $C$DW$2127, DW_AT_type(*$C$DW$T$39)
   15988                      .dwattr $C$DW$2127, DW_AT_name("gpioHandle")
   15989                      .dwattr $C$DW$2127, DW_AT_TI_symbol_name("_gpioHandle")
   15990                      .dwattr $C$DW$2127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15991                      .dwattr $C$DW$2127, DW_AT_accessibility(DW_ACCESS_public)
   15992              
   15993              $C$DW$2128      .dwtag  DW_TAG_member
   15994                      .dwattr $C$DW$2128, DW_AT_type(*$C$DW$T$98)
   15995                      .dwattr $C$DW$2128, DW_AT_name("offsetHandle_I")
   15996                      .dwattr $C$DW$2128, DW_AT_TI_symbol_name("_offsetHandle_I")
   15997                      .dwattr $C$DW$2128, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15998                      .dwattr $C$DW$2128, DW_AT_accessibility(DW_ACCESS_public)
   15999              
   16000              $C$DW$2129      .dwtag  DW_TAG_member
   16001                      .dwattr $C$DW$2129, DW_AT_type(*$C$DW$T$100)
   16002                      .dwattr $C$DW$2129, DW_AT_name("offset_I")
   16003                      .dwattr $C$DW$2129, DW_AT_TI_symbol_name("_offset_I")
   16004                      .dwattr $C$DW$2129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16005                      .dwattr $C$DW$2129, DW_AT_accessibility(DW_ACCESS_public)
   16006              
   16007              $C$DW$2130      .dwtag  DW_TAG_member
   16008                      .dwattr $C$DW$2130, DW_AT_type(*$C$DW$T$98)
   16009                      .dwattr $C$DW$2130, DW_AT_name("offsetHandle_V")
   16010                      .dwattr $C$DW$2130, DW_AT_TI_symbol_name("_offsetHandle_V")
   16011                      .dwattr $C$DW$2130, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   16012                      .dwattr $C$DW$2130, DW_AT_accessibility(DW_ACCESS_public)
   16013              
   16014              $C$DW$2131      .dwtag  DW_TAG_member
   16015                      .dwattr $C$DW$2131, DW_AT_type(*$C$DW$T$100)
   16016                      .dwattr $C$DW$2131, DW_AT_name("offset_V")
   16017                      .dwattr $C$DW$2131, DW_AT_TI_symbol_name("_offset_V")
   16018                      .dwattr $C$DW$2131, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   16019                      .dwattr $C$DW$2131, DW_AT_accessibility(DW_ACCESS_public)
   16020              
   16021              $C$DW$2132      .dwtag  DW_TAG_member
   16022                      .dwattr $C$DW$2132, DW_AT_type(*$C$DW$T$102)
   16023                      .dwattr $C$DW$2132, DW_AT_name("oscHandle")
   16024                      .dwattr $C$DW$2132, DW_AT_TI_symbol_name("_oscHandle")
   16025                      .dwattr $C$DW$2132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   16026                      .dwattr $C$DW$2132, DW_AT_accessibility(DW_ACCESS_public)
   16027              
   16028              $C$DW$2133      .dwtag  DW_TAG_member
   16029                      .dwattr $C$DW$2133, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIorutN2JOz                                                 PAGE  303

   16030                      .dwattr $C$DW$2133, DW_AT_name("pieHandle")
   16031                      .dwattr $C$DW$2133, DW_AT_TI_symbol_name("_pieHandle")
   16032                      .dwattr $C$DW$2133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   16033                      .dwattr $C$DW$2133, DW_AT_accessibility(DW_ACCESS_public)
   16034              
   16035              $C$DW$2134      .dwtag  DW_TAG_member
   16036                      .dwattr $C$DW$2134, DW_AT_type(*$C$DW$T$106)
   16037                      .dwattr $C$DW$2134, DW_AT_name("pllHandle")
   16038                      .dwattr $C$DW$2134, DW_AT_TI_symbol_name("_pllHandle")
   16039                      .dwattr $C$DW$2134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   16040                      .dwattr $C$DW$2134, DW_AT_accessibility(DW_ACCESS_public)
   16041              
   16042              $C$DW$2135      .dwtag  DW_TAG_member
   16043                      .dwattr $C$DW$2135, DW_AT_type(*$C$DW$T$109)
   16044                      .dwattr $C$DW$2135, DW_AT_name("pwmHandle")
   16045                      .dwattr $C$DW$2135, DW_AT_TI_symbol_name("_pwmHandle")
   16046                      .dwattr $C$DW$2135, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   16047                      .dwattr $C$DW$2135, DW_AT_accessibility(DW_ACCESS_public)
   16048              
   16049              $C$DW$2136      .dwtag  DW_TAG_member
   16050                      .dwattr $C$DW$2136, DW_AT_type(*$C$DW$T$109)
   16051                      .dwattr $C$DW$2136, DW_AT_name("pwmDacHandle")
   16052                      .dwattr $C$DW$2136, DW_AT_TI_symbol_name("_pwmDacHandle")
   16053                      .dwattr $C$DW$2136, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   16054                      .dwattr $C$DW$2136, DW_AT_accessibility(DW_ACCESS_public)
   16055              
   16056              $C$DW$2137      .dwtag  DW_TAG_member
   16057                      .dwattr $C$DW$2137, DW_AT_type(*$C$DW$T$111)
   16058                      .dwattr $C$DW$2137, DW_AT_name("pwrHandle")
   16059                      .dwattr $C$DW$2137, DW_AT_TI_symbol_name("_pwrHandle")
   16060                      .dwattr $C$DW$2137, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   16061                      .dwattr $C$DW$2137, DW_AT_accessibility(DW_ACCESS_public)
   16062              
   16063              $C$DW$2138      .dwtag  DW_TAG_member
   16064                      .dwattr $C$DW$2138, DW_AT_type(*$C$DW$T$114)
   16065                      .dwattr $C$DW$2138, DW_AT_name("timerHandle")
   16066                      .dwattr $C$DW$2138, DW_AT_TI_symbol_name("_timerHandle")
   16067                      .dwattr $C$DW$2138, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   16068                      .dwattr $C$DW$2138, DW_AT_accessibility(DW_ACCESS_public)
   16069              
   16070              $C$DW$2139      .dwtag  DW_TAG_member
   16071                      .dwattr $C$DW$2139, DW_AT_type(*$C$DW$T$116)
   16072                      .dwattr $C$DW$2139, DW_AT_name("wdogHandle")
   16073                      .dwattr $C$DW$2139, DW_AT_TI_symbol_name("_wdogHandle")
   16074                      .dwattr $C$DW$2139, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   16075                      .dwattr $C$DW$2139, DW_AT_accessibility(DW_ACCESS_public)
   16076              
   16077              $C$DW$2140      .dwtag  DW_TAG_member
   16078                      .dwattr $C$DW$2140, DW_AT_type(*$C$DW$T$117)
   16079                      .dwattr $C$DW$2140, DW_AT_name("adcBias")
   16080                      .dwattr $C$DW$2140, DW_AT_TI_symbol_name("_adcBias")
   16081                      .dwattr $C$DW$2140, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   16082                      .dwattr $C$DW$2140, DW_AT_accessibility(DW_ACCESS_public)
   16083              
   16084              $C$DW$2141      .dwtag  DW_TAG_member
