TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                           Unix v22.6.0.LTS *
       3              ;* Date/Time created: Thu Sep 21 22:05:21 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/Users/paiva/Documents/ti/motorware_1_01_00_18/sw/solutions/instaspin_f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen Unix v22.6.0.LTS Copyright (c) 1996
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/paiva/Documents/ti/motorware_1_01_00_18/sw/solutions/instasp
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7713              $C$DW$830       .dwtag  DW_TAG_enumerator
    7714                      .dwattr $C$DW$830, DW_AT_name("PIE_GroupNumber_7")
    7715                      .dwattr $C$DW$830, DW_AT_const_value(0x06)
    7716              
    7717              $C$DW$831       .dwtag  DW_TAG_enumerator
    7718                      .dwattr $C$DW$831, DW_AT_name("PIE_GroupNumber_8")
    7719                      .dwattr $C$DW$831, DW_AT_const_value(0x07)
    7720              
    7721              $C$DW$832       .dwtag  DW_TAG_enumerator
    7722                      .dwattr $C$DW$832, DW_AT_name("PIE_GroupNumber_9")
    7723                      .dwattr $C$DW$832, DW_AT_const_value(0x08)
    7724              
    7725              $C$DW$833       .dwtag  DW_TAG_enumerator
    7726                      .dwattr $C$DW$833, DW_AT_name("PIE_GroupNumber_10")
    7727                      .dwattr $C$DW$833, DW_AT_const_value(0x09)
    7728              
    7729              $C$DW$834       .dwtag  DW_TAG_enumerator
    7730                      .dwattr $C$DW$834, DW_AT_name("PIE_GroupNumber_11")
    7731                      .dwattr $C$DW$834, DW_AT_const_value(0x0a)
    7732              
    7733              $C$DW$835       .dwtag  DW_TAG_enumerator
    7734                      .dwattr $C$DW$835, DW_AT_name("PIE_GroupNumber_12")
    7735                      .dwattr $C$DW$835, DW_AT_const_value(0x0b)
    7736              
    7737                      .dwendtag $C$DW$T$221
    7738              
    7739              $C$DW$T$222     .dwtag  DW_TAG_typedef
    7740                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    7741                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    7742                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    7743              
    7744              
    7745              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    7746                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    7747              $C$DW$836       .dwtag  DW_TAG_enumerator
    7748                      .dwattr $C$DW$836, DW_AT_name("CTRL_Type_PID_spd")
    7749                      .dwattr $C$DW$836, DW_AT_const_value(0x00)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  152

    7750              
    7751              $C$DW$837       .dwtag  DW_TAG_enumerator
    7752                      .dwattr $C$DW$837, DW_AT_name("CTRL_Type_PID_Id")
    7753                      .dwattr $C$DW$837, DW_AT_const_value(0x01)
    7754              
    7755              $C$DW$838       .dwtag  DW_TAG_enumerator
    7756                      .dwattr $C$DW$838, DW_AT_name("CTRL_Type_PID_Iq")
    7757                      .dwattr $C$DW$838, DW_AT_const_value(0x02)
    7758              
    7759                      .dwendtag $C$DW$T$224
    7760              
    7761              $C$DW$T$225     .dwtag  DW_TAG_typedef
    7762                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    7763                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    7764                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    7765              
    7766              
    7767              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    7768                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    7769              $C$DW$839       .dwtag  DW_TAG_enumerator
    7770                      .dwattr $C$DW$839, DW_AT_name("HAL_SensorType_Current")
    7771                      .dwattr $C$DW$839, DW_AT_const_value(0x00)
    7772              
    7773              $C$DW$840       .dwtag  DW_TAG_enumerator
    7774                      .dwattr $C$DW$840, DW_AT_name("HAL_SensorType_Voltage")
    7775                      .dwattr $C$DW$840, DW_AT_const_value(0x01)
    7776              
    7777                      .dwendtag $C$DW$T$227
    7778              
    7779              $C$DW$T$228     .dwtag  DW_TAG_typedef
    7780                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    7781                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    7782                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    7783              
    7784              
    7785              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7786                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    7787                      .dwattr $C$DW$T$19, DW_AT_declaration
    7788                      .dwendtag $C$DW$T$19
    7789              
    7790              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    7791                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    7792                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    7793              
    7794              $C$DW$T$231     .dwtag  DW_TAG_typedef
    7795                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    7796                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    7797                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    7798              
    7799              
    7800              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7801                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    7802                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    7803              $C$DW$841       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  153

    7805                      .dwattr $C$DW$841, DW_AT_name("ADCRESULT")
    7806                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_ADCRESULT")
    7807                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7808                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7809              
    7810              $C$DW$842       .dwtag  DW_TAG_member
    7811                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$29)
    7812                      .dwattr $C$DW$842, DW_AT_name("resvd_1")
    7813                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_resvd_1")
    7814                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7815                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7816              
    7817              $C$DW$843       .dwtag  DW_TAG_member
    7818                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$27)
    7819                      .dwattr $C$DW$843, DW_AT_name("ADCCTL1")
    7820                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_ADCCTL1")
    7821                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7822                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7823              
    7824              $C$DW$844       .dwtag  DW_TAG_member
    7825                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$27)
    7826                      .dwattr $C$DW$844, DW_AT_name("ADCCTL2")
    7827                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_ADCCTL2")
    7828                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7829                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7830              
    7831              $C$DW$845       .dwtag  DW_TAG_member
    7832                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$30)
    7833                      .dwattr $C$DW$845, DW_AT_name("rsvd_2")
    7834                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_rsvd_2")
    7835                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7836                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7837              
    7838              $C$DW$846       .dwtag  DW_TAG_member
    7839                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$27)
    7840                      .dwattr $C$DW$846, DW_AT_name("ADCINTFLG")
    7841                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_ADCINTFLG")
    7842                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7843                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7844              
    7845              $C$DW$847       .dwtag  DW_TAG_member
    7846                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$27)
    7847                      .dwattr $C$DW$847, DW_AT_name("ADCINTFLGCLR")
    7848                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7849                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7850                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7851              
    7852              $C$DW$848       .dwtag  DW_TAG_member
    7853                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$27)
    7854                      .dwattr $C$DW$848, DW_AT_name("ADCINTOVF")
    7855                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_ADCINTOVF")
    7856                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7857                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7858              
    7859              $C$DW$849       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  154

    7860                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$27)
    7861                      .dwattr $C$DW$849, DW_AT_name("ADCINTOVFCLR")
    7862                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7863                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7864                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7865              
    7866              $C$DW$850       .dwtag  DW_TAG_member
    7867                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$31)
    7868                      .dwattr $C$DW$850, DW_AT_name("INTSELxNy")
    7869                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_INTSELxNy")
    7870                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7871                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7872              
    7873              $C$DW$851       .dwtag  DW_TAG_member
    7874                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$32)
    7875                      .dwattr $C$DW$851, DW_AT_name("rsvd_3")
    7876                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_rsvd_3")
    7877                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7878                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    7879              
    7880              $C$DW$852       .dwtag  DW_TAG_member
    7881                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$27)
    7882                      .dwattr $C$DW$852, DW_AT_name("SOCPRICTRL")
    7883                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7884                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7885                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    7886              
    7887              $C$DW$853       .dwtag  DW_TAG_member
    7888                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$27)
    7889                      .dwattr $C$DW$853, DW_AT_name("rsvd_4")
    7890                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_rsvd_4")
    7891                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7892                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    7893              
    7894              $C$DW$854       .dwtag  DW_TAG_member
    7895                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$27)
    7896                      .dwattr $C$DW$854, DW_AT_name("ADCSAMPLEMODE")
    7897                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7898                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7899                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    7900              
    7901              $C$DW$855       .dwtag  DW_TAG_member
    7902                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$27)
    7903                      .dwattr $C$DW$855, DW_AT_name("rsvd_5")
    7904                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_rsvd_5")
    7905                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7906                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    7907              
    7908              $C$DW$856       .dwtag  DW_TAG_member
    7909                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$27)
    7910                      .dwattr $C$DW$856, DW_AT_name("ADCINTSOCSEL1")
    7911                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7912                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7913                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    7914              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  155

    7915              $C$DW$857       .dwtag  DW_TAG_member
    7916                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$27)
    7917                      .dwattr $C$DW$857, DW_AT_name("ADCINTSOCSEL2")
    7918                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7919                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7920                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    7921              
    7922              $C$DW$858       .dwtag  DW_TAG_member
    7923                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$30)
    7924                      .dwattr $C$DW$858, DW_AT_name("rsvd_6")
    7925                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_rsvd_6")
    7926                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7927                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    7928              
    7929              $C$DW$859       .dwtag  DW_TAG_member
    7930                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$27)
    7931                      .dwattr $C$DW$859, DW_AT_name("ADCSOCFLG1")
    7932                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7933                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7934                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    7935              
    7936              $C$DW$860       .dwtag  DW_TAG_member
    7937                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$27)
    7938                      .dwattr $C$DW$860, DW_AT_name("rsvd_7")
    7939                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_rsvd_7")
    7940                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7941                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    7942              
    7943              $C$DW$861       .dwtag  DW_TAG_member
    7944                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$27)
    7945                      .dwattr $C$DW$861, DW_AT_name("ADCSOCFRC1")
    7946                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7947                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7948                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    7949              
    7950              $C$DW$862       .dwtag  DW_TAG_member
    7951                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$27)
    7952                      .dwattr $C$DW$862, DW_AT_name("rsvd_8")
    7953                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_rsvd_8")
    7954                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7955                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    7956              
    7957              $C$DW$863       .dwtag  DW_TAG_member
    7958                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$27)
    7959                      .dwattr $C$DW$863, DW_AT_name("ADCSOCOVF1")
    7960                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7961                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7962                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    7963              
    7964              $C$DW$864       .dwtag  DW_TAG_member
    7965                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$27)
    7966                      .dwattr $C$DW$864, DW_AT_name("rsvd_9")
    7967                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_rsvd_9")
    7968                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7969                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  156

    7970              
    7971              $C$DW$865       .dwtag  DW_TAG_member
    7972                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$27)
    7973                      .dwattr $C$DW$865, DW_AT_name("ADCSOCOVFCLR1")
    7974                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7975                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7976                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    7977              
    7978              $C$DW$866       .dwtag  DW_TAG_member
    7979                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$27)
    7980                      .dwattr $C$DW$866, DW_AT_name("rsvd_10")
    7981                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_rsvd_10")
    7982                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7983                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    7984              
    7985              $C$DW$867       .dwtag  DW_TAG_member
    7986                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$28)
    7987                      .dwattr $C$DW$867, DW_AT_name("ADCSOCxCTL")
    7988                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7989                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7990                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    7991              
    7992              $C$DW$868       .dwtag  DW_TAG_member
    7993                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$28)
    7994                      .dwattr $C$DW$868, DW_AT_name("rsvd_11")
    7995                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_rsvd_11")
    7996                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7997                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    7998              
    7999              $C$DW$869       .dwtag  DW_TAG_member
    8000                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$27)
    8001                      .dwattr $C$DW$869, DW_AT_name("ADCREFTRIM")
    8002                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8003                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8004                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    8005              
    8006              $C$DW$870       .dwtag  DW_TAG_member
    8007                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$27)
    8008                      .dwattr $C$DW$870, DW_AT_name("ADCOFFTRIM")
    8009                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8010                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8011                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    8012              
    8013              $C$DW$871       .dwtag  DW_TAG_member
    8014                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$33)
    8015                      .dwattr $C$DW$871, DW_AT_name("resvd_12")
    8016                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_resvd_12")
    8017                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8018                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    8019              
    8020              $C$DW$872       .dwtag  DW_TAG_member
    8021                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$27)
    8022                      .dwattr $C$DW$872, DW_AT_name("ADCREV")
    8023                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_ADCREV")
    8024                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  157

    8025                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    8026              
    8027                      .dwendtag $C$DW$T$34
    8028              
    8029              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8030                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8031                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8032                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8033              
    8034              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8035                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8036                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8037              
    8038              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8039                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8040                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8041                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8042              
    8043              
    8044              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8045                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8046                      .dwattr $C$DW$T$20, DW_AT_declaration
    8047                      .dwendtag $C$DW$T$20
    8048              
    8049              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8050                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8051                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8052              
    8053              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8054                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8055                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8056                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8057              
    8058              
    8059              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8060                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8061                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8062              $C$DW$873       .dwtag  DW_TAG_member
    8063                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$35)
    8064                      .dwattr $C$DW$873, DW_AT_name("alpha_sf")
    8065                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_alpha_sf")
    8066                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8067                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    8068              
    8069              $C$DW$874       .dwtag  DW_TAG_member
    8070                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$35)
    8071                      .dwattr $C$DW$874, DW_AT_name("beta_sf")
    8072                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_beta_sf")
    8073                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8074                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    8075              
    8076              $C$DW$875       .dwtag  DW_TAG_member
    8077                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$37)
    8078                      .dwattr $C$DW$875, DW_AT_name("numSensors")
    8079                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_numSensors")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  158

    8080                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8081                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    8082              
    8083                      .dwendtag $C$DW$T$38
    8084              
    8085              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8086                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8087                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8088                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8089              
    8090              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8091                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8092                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8093              
    8094              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8095                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8096                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8097                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8098              
    8099              $C$DW$876       .dwtag  DW_TAG_TI_far_type
    8100                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$48)
    8101              
    8102              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8103                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$876)
    8104              
    8105              
    8106              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8107                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8108                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8109              $C$DW$877       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$27)
    8111                      .dwattr $C$DW$877, DW_AT_name("XCLK")
    8112                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_XCLK")
    8113                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8114                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$878       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$27)
    8118                      .dwattr $C$DW$878, DW_AT_name("rsvd_1")
    8119                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_rsvd_1")
    8120                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8121                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$879       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$27)
    8125                      .dwattr $C$DW$879, DW_AT_name("CLKCTL")
    8126                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_CLKCTL")
    8127                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8128                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$880       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$39)
    8132                      .dwattr $C$DW$880, DW_AT_name("rsvd_2")
    8133                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_rsvd_2")
    8134                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  159

    8135                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137              $C$DW$881       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$27)
    8139                      .dwattr $C$DW$881, DW_AT_name("LOSPCP")
    8140                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_LOSPCP")
    8141                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8142                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    8143              
    8144              $C$DW$882       .dwtag  DW_TAG_member
    8145                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$27)
    8146                      .dwattr $C$DW$882, DW_AT_name("PCLKCR0")
    8147                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_PCLKCR0")
    8148                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8149                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    8150              
    8151              $C$DW$883       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$27)
    8153                      .dwattr $C$DW$883, DW_AT_name("PCLKCR1")
    8154                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_PCLKCR1")
    8155                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8156                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    8157              
    8158              $C$DW$884       .dwtag  DW_TAG_member
    8159                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$30)
    8160                      .dwattr $C$DW$884, DW_AT_name("rsvd_3")
    8161                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_rsvd_3")
    8162                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8163                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    8164              
    8165              $C$DW$885       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$27)
    8167                      .dwattr $C$DW$885, DW_AT_name("PCLKCR3")
    8168                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_PCLKCR3")
    8169                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8170                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    8171              
    8172                      .dwendtag $C$DW$T$40
    8173              
    8174              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    8175                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    8176                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    8177              
    8178              $C$DW$T$127     .dwtag  DW_TAG_typedef
    8179                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    8180                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    8181                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8182              
    8183              
    8184              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8185                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    8186                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    8187              $C$DW$886       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$37)
    8189                      .dwattr $C$DW$886, DW_AT_name("tmp")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  160

    8190                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_tmp")
    8191                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8192                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    8193              
    8194                      .dwendtag $C$DW$T$41
    8195              
    8196              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8197                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    8198                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8199              
    8200              $C$DW$T$129     .dwtag  DW_TAG_typedef
    8201                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    8202                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    8203                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    8204              
    8205              
    8206              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8207                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    8208                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x108)
    8209              $C$DW$887       .dwtag  DW_TAG_member
    8210                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$42)
    8211                      .dwattr $C$DW$887, DW_AT_name("version")
    8212                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_version")
    8213                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8214                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8215              
    8216              $C$DW$888       .dwtag  DW_TAG_member
    8217                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$44)
    8218                      .dwattr $C$DW$888, DW_AT_name("state")
    8219                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_state")
    8220                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8221                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8222              
    8223              $C$DW$889       .dwtag  DW_TAG_member
    8224                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$44)
    8225                      .dwattr $C$DW$889, DW_AT_name("prevState")
    8226                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_prevState")
    8227                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8228                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8229              
    8230              $C$DW$890       .dwtag  DW_TAG_member
    8231                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$46)
    8232                      .dwattr $C$DW$890, DW_AT_name("errorCode")
    8233                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_errorCode")
    8234                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8235                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8236              
    8237              $C$DW$891       .dwtag  DW_TAG_member
    8238                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$48)
    8239                      .dwattr $C$DW$891, DW_AT_name("clarkeHandle_I")
    8240                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8241                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8242                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8243              
    8244              $C$DW$892       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  161

    8245                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$49)
    8246                      .dwattr $C$DW$892, DW_AT_name("clarke_I")
    8247                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_clarke_I")
    8248                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8249                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8250              
    8251              $C$DW$893       .dwtag  DW_TAG_member
    8252                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$48)
    8253                      .dwattr $C$DW$893, DW_AT_name("clarkeHandle_V")
    8254                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8255                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8256                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8257              
    8258              $C$DW$894       .dwtag  DW_TAG_member
    8259                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$49)
    8260                      .dwattr $C$DW$894, DW_AT_name("clarke_V")
    8261                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_clarke_V")
    8262                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8263                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8264              
    8265              $C$DW$895       .dwtag  DW_TAG_member
    8266                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$51)
    8267                      .dwattr $C$DW$895, DW_AT_name("estHandle")
    8268                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_estHandle")
    8269                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8270                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8271              
    8272              $C$DW$896       .dwtag  DW_TAG_member
    8273                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$53)
    8274                      .dwattr $C$DW$896, DW_AT_name("parkHandle")
    8275                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_parkHandle")
    8276                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8277                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8278              
    8279              $C$DW$897       .dwtag  DW_TAG_member
    8280                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$54)
    8281                      .dwattr $C$DW$897, DW_AT_name("park")
    8282                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_park")
    8283                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8284                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8285              
    8286              $C$DW$898       .dwtag  DW_TAG_member
    8287                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$56)
    8288                      .dwattr $C$DW$898, DW_AT_name("pidHandle_Id")
    8289                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_pidHandle_Id")
    8290                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8291                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8292              
    8293              $C$DW$899       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$57)
    8295                      .dwattr $C$DW$899, DW_AT_name("pid_Id")
    8296                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_pid_Id")
    8297                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8298                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8299              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  162

    8300              $C$DW$900       .dwtag  DW_TAG_member
    8301                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$56)
    8302                      .dwattr $C$DW$900, DW_AT_name("pidHandle_Iq")
    8303                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8304                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8305                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8306              
    8307              $C$DW$901       .dwtag  DW_TAG_member
    8308                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$57)
    8309                      .dwattr $C$DW$901, DW_AT_name("pid_Iq")
    8310                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_pid_Iq")
    8311                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8312                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8313              
    8314              $C$DW$902       .dwtag  DW_TAG_member
    8315                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$56)
    8316                      .dwattr $C$DW$902, DW_AT_name("pidHandle_spd")
    8317                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_pidHandle_spd")
    8318                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8319                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8320              
    8321              $C$DW$903       .dwtag  DW_TAG_member
    8322                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$57)
    8323                      .dwattr $C$DW$903, DW_AT_name("pid_spd")
    8324                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_pid_spd")
    8325                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8326                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8327              
    8328              $C$DW$904       .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$59)
    8330                      .dwattr $C$DW$904, DW_AT_name("iparkHandle")
    8331                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_iparkHandle")
    8332                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8333                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8334              
    8335              $C$DW$905       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$60)
    8337                      .dwattr $C$DW$905, DW_AT_name("ipark")
    8338                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ipark")
    8339                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8340                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8341              
    8342              $C$DW$906       .dwtag  DW_TAG_member
    8343                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$62)
    8344                      .dwattr $C$DW$906, DW_AT_name("svgenHandle")
    8345                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_svgenHandle")
    8346                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8347                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8348              
    8349              $C$DW$907       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$63)
    8351                      .dwattr $C$DW$907, DW_AT_name("svgen")
    8352                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_svgen")
    8353                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8354                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  163

    8355              
    8356              $C$DW$908       .dwtag  DW_TAG_member
    8357                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$65)
    8358                      .dwattr $C$DW$908, DW_AT_name("trajHandle_Id")
    8359                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_trajHandle_Id")
    8360                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8361                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8362              
    8363              $C$DW$909       .dwtag  DW_TAG_member
    8364                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$66)
    8365                      .dwattr $C$DW$909, DW_AT_name("traj_Id")
    8366                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_traj_Id")
    8367                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8368                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8369              
    8370              $C$DW$910       .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$65)
    8372                      .dwattr $C$DW$910, DW_AT_name("trajHandle_spd")
    8373                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_trajHandle_spd")
    8374                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8375                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8376              
    8377              $C$DW$911       .dwtag  DW_TAG_member
    8378                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$66)
    8379                      .dwattr $C$DW$911, DW_AT_name("traj_spd")
    8380                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_traj_spd")
    8381                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8382                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8383              
    8384              $C$DW$912       .dwtag  DW_TAG_member
    8385                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$65)
    8386                      .dwattr $C$DW$912, DW_AT_name("trajHandle_spdMax")
    8387                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8388                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8389                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8390              
    8391              $C$DW$913       .dwtag  DW_TAG_member
    8392                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$66)
    8393                      .dwattr $C$DW$913, DW_AT_name("traj_spdMax")
    8394                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_traj_spdMax")
    8395                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8396                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8397              
    8398              $C$DW$914       .dwtag  DW_TAG_member
    8399                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$67)
    8400                      .dwattr $C$DW$914, DW_AT_name("motorParams")
    8401                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_motorParams")
    8402                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8403                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8404              
    8405              $C$DW$915       .dwtag  DW_TAG_member
    8406                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$71)
    8407                      .dwattr $C$DW$915, DW_AT_name("waitTimes")
    8408                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_waitTimes")
    8409                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  164

    8410                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8411              
    8412              $C$DW$916       .dwtag  DW_TAG_member
    8413                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$70)
    8414                      .dwattr $C$DW$916, DW_AT_name("counter_state")
    8415                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_counter_state")
    8416                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8417                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8418              
    8419              $C$DW$917       .dwtag  DW_TAG_member
    8420                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$73)
    8421                      .dwattr $C$DW$917, DW_AT_name("numIsrTicksPerCtrlTick")
    8422                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8423                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8424                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8425              
    8426              $C$DW$918       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$73)
    8428                      .dwattr $C$DW$918, DW_AT_name("numCtrlTicksPerCurrentTick")
    8429                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8430                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8431                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8432              
    8433              $C$DW$919       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$73)
    8435                      .dwattr $C$DW$919, DW_AT_name("numCtrlTicksPerSpeedTick")
    8436                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8437                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8438                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8439              
    8440              $C$DW$920       .dwtag  DW_TAG_member
    8441                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$73)
    8442                      .dwattr $C$DW$920, DW_AT_name("numCtrlTicksPerTrajTick")
    8443                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8444                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8445                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8446              
    8447              $C$DW$921       .dwtag  DW_TAG_member
    8448                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$70)
    8449                      .dwattr $C$DW$921, DW_AT_name("ctrlFreq_Hz")
    8450                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8451                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8452                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8453              
    8454              $C$DW$922       .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$70)
    8456                      .dwattr $C$DW$922, DW_AT_name("trajFreq_Hz")
    8457                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8458                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8459                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8460              
    8461              $C$DW$923       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$35)
    8463                      .dwattr $C$DW$923, DW_AT_name("trajPeriod_sec")
    8464                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_trajPeriod_sec")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  165

    8465                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8466                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8467              
    8468              $C$DW$924       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$74)
    8470                      .dwattr $C$DW$924, DW_AT_name("ctrlPeriod_sec")
    8471                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8472                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8473                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8474              
    8475              $C$DW$925       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$35)
    8477                      .dwattr $C$DW$925, DW_AT_name("maxVsMag_pu")
    8478                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8479                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8480                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8481              
    8482              $C$DW$926       .dwtag  DW_TAG_member
    8483                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$75)
    8484                      .dwattr $C$DW$926, DW_AT_name("Iab_in")
    8485                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_Iab_in")
    8486                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8487                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8488              
    8489              $C$DW$927       .dwtag  DW_TAG_member
    8490                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$75)
    8491                      .dwattr $C$DW$927, DW_AT_name("Iab_filt")
    8492                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_Iab_filt")
    8493                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8494                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8495              
    8496              $C$DW$928       .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$75)
    8498                      .dwattr $C$DW$928, DW_AT_name("Idq_in")
    8499                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_Idq_in")
    8500                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8501                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8502              
    8503              $C$DW$929       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$75)
    8505                      .dwattr $C$DW$929, DW_AT_name("Vab_in")
    8506                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_Vab_in")
    8507                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8508                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8509              
    8510              $C$DW$930       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$35)
    8512                      .dwattr $C$DW$930, DW_AT_name("spd_out")
    8513                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_spd_out")
    8514                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8515                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$931       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$75)
    8519                      .dwattr $C$DW$931, DW_AT_name("Vab_out")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  166

    8520                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_Vab_out")
    8521                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8522                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$932       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$75)
    8526                      .dwattr $C$DW$932, DW_AT_name("Vdq_out")
    8527                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_Vdq_out")
    8528                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8529                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$933       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$74)
    8533                      .dwattr $C$DW$933, DW_AT_name("Rhf")
    8534                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_Rhf")
    8535                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8536                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$934       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$74)
    8540                      .dwattr $C$DW$934, DW_AT_name("Lhf")
    8541                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_Lhf")
    8542                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8543                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$935       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$74)
    8547                      .dwattr $C$DW$935, DW_AT_name("RoverL")
    8548                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_RoverL")
    8549                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8550                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552              $C$DW$936       .dwtag  DW_TAG_member
    8553                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$35)
    8554                      .dwattr $C$DW$936, DW_AT_name("Kp_Id")
    8555                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_Kp_Id")
    8556                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8557                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8558              
    8559              $C$DW$937       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$35)
    8561                      .dwattr $C$DW$937, DW_AT_name("Kp_Iq")
    8562                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_Kp_Iq")
    8563                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8564                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8565              
    8566              $C$DW$938       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$35)
    8568                      .dwattr $C$DW$938, DW_AT_name("Kp_spd")
    8569                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_Kp_spd")
    8570                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8571                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8572              
    8573              $C$DW$939       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  167

    8575                      .dwattr $C$DW$939, DW_AT_name("Ki_Id")
    8576                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_Ki_Id")
    8577                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8578                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8579              
    8580              $C$DW$940       .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$35)
    8582                      .dwattr $C$DW$940, DW_AT_name("Ki_Iq")
    8583                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_Ki_Iq")
    8584                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8585                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8586              
    8587              $C$DW$941       .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$35)
    8589                      .dwattr $C$DW$941, DW_AT_name("Ki_spd")
    8590                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_Ki_spd")
    8591                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8592                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8593              
    8594              $C$DW$942       .dwtag  DW_TAG_member
    8595                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$35)
    8596                      .dwattr $C$DW$942, DW_AT_name("Kd_Id")
    8597                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_Kd_Id")
    8598                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8599                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8600              
    8601              $C$DW$943       .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$35)
    8603                      .dwattr $C$DW$943, DW_AT_name("Kd_Iq")
    8604                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_Kd_Iq")
    8605                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8606                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8607              
    8608              $C$DW$944       .dwtag  DW_TAG_member
    8609                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$35)
    8610                      .dwattr $C$DW$944, DW_AT_name("Kd_spd")
    8611                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_Kd_spd")
    8612                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8613                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8614              
    8615              $C$DW$945       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$35)
    8617                      .dwattr $C$DW$945, DW_AT_name("Ui_Id")
    8618                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_Ui_Id")
    8619                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8620                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8621              
    8622              $C$DW$946       .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$35)
    8624                      .dwattr $C$DW$946, DW_AT_name("Ui_Iq")
    8625                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_Ui_Iq")
    8626                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8627                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8628              
    8629              $C$DW$947       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  168

    8630                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$35)
    8631                      .dwattr $C$DW$947, DW_AT_name("Ui_spd")
    8632                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_Ui_spd")
    8633                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8634                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8635              
    8636              $C$DW$948       .dwtag  DW_TAG_member
    8637                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$75)
    8638                      .dwattr $C$DW$948, DW_AT_name("Idq_ref")
    8639                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_Idq_ref")
    8640                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8641                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8642              
    8643              $C$DW$949       .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$35)
    8645                      .dwattr $C$DW$949, DW_AT_name("IdRated")
    8646                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_IdRated")
    8647                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8648                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8649              
    8650              $C$DW$950       .dwtag  DW_TAG_member
    8651                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$35)
    8652                      .dwattr $C$DW$950, DW_AT_name("spd_ref")
    8653                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_spd_ref")
    8654                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8655                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    8656              
    8657              $C$DW$951       .dwtag  DW_TAG_member
    8658                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$35)
    8659                      .dwattr $C$DW$951, DW_AT_name("spd_max")
    8660                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_spd_max")
    8661                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8662                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    8663              
    8664              $C$DW$952       .dwtag  DW_TAG_member
    8665                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$73)
    8666                      .dwattr $C$DW$952, DW_AT_name("counter_current")
    8667                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_counter_current")
    8668                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8669                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    8670              
    8671              $C$DW$953       .dwtag  DW_TAG_member
    8672                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$73)
    8673                      .dwattr $C$DW$953, DW_AT_name("counter_isr")
    8674                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_counter_isr")
    8675                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8676                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    8677              
    8678              $C$DW$954       .dwtag  DW_TAG_member
    8679                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$73)
    8680                      .dwattr $C$DW$954, DW_AT_name("counter_speed")
    8681                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_counter_speed")
    8682                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8683                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    8684              
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  169

    8685              $C$DW$955       .dwtag  DW_TAG_member
    8686                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$73)
    8687                      .dwattr $C$DW$955, DW_AT_name("counter_traj")
    8688                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_counter_traj")
    8689                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8690                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    8691              
    8692              $C$DW$956       .dwtag  DW_TAG_member
    8693                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$76)
    8694                      .dwattr $C$DW$956, DW_AT_name("flag_enableCtrl")
    8695                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8696                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8697                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    8698              
    8699              $C$DW$957       .dwtag  DW_TAG_member
    8700                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$76)
    8701                      .dwattr $C$DW$957, DW_AT_name("flag_enableDcBusComp")
    8702                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8703                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8704                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    8705              
    8706              $C$DW$958       .dwtag  DW_TAG_member
    8707                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$76)
    8708                      .dwattr $C$DW$958, DW_AT_name("flag_enablePowerWarp")
    8709                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8710                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8711                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    8712              
    8713              $C$DW$959       .dwtag  DW_TAG_member
    8714                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$76)
    8715                      .dwattr $C$DW$959, DW_AT_name("flag_enableOffset")
    8716                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_flag_enableOffset")
    8717                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8718                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    8719              
    8720              $C$DW$960       .dwtag  DW_TAG_member
    8721                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$76)
    8722                      .dwattr $C$DW$960, DW_AT_name("flag_enableSpeedCtrl")
    8723                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8724                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8725                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    8726              
    8727              $C$DW$961       .dwtag  DW_TAG_member
    8728                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$76)
    8729                      .dwattr $C$DW$961, DW_AT_name("flag_enableUserMotorParams")
    8730                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8731                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8732                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    8733              
    8734              $C$DW$962       .dwtag  DW_TAG_member
    8735                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$75)
    8736                      .dwattr $C$DW$962, DW_AT_name("Idq_offset_pu")
    8737                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8738                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8739                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  170

    8740              
    8741              $C$DW$963       .dwtag  DW_TAG_member
    8742                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$75)
    8743                      .dwattr $C$DW$963, DW_AT_name("Vdq_offset_pu")
    8744                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8745                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8746                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    8747              
    8748              $C$DW$964       .dwtag  DW_TAG_member
    8749                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$35)
    8750                      .dwattr $C$DW$964, DW_AT_name("angle_pu")
    8751                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_angle_pu")
    8752                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8753                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    8754              
    8755              $C$DW$965       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$35)
    8757                      .dwattr $C$DW$965, DW_AT_name("speed_ref_pu")
    8758                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_speed_ref_pu")
    8759                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8760                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    8761              
    8762              $C$DW$966       .dwtag  DW_TAG_member
    8763                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$35)
    8764                      .dwattr $C$DW$966, DW_AT_name("speed_fb_pu")
    8765                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_speed_fb_pu")
    8766                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8767                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    8768              
    8769              $C$DW$967       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$35)
    8771                      .dwattr $C$DW$967, DW_AT_name("speed_outMax_pu")
    8772                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8773                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8774                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    8775              
    8776              $C$DW$968       .dwtag  DW_TAG_member
    8777                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$76)
    8778                      .dwattr $C$DW$968, DW_AT_name("flag_enableCurrentCtrl")
    8779                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8780                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8781                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    8782              
    8783                      .dwendtag $C$DW$T$77
    8784              
    8785              $C$DW$T$248     .dwtag  DW_TAG_typedef
    8786                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    8787                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    8788                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    8789              
    8790              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    8791                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    8792                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    8793              
    8794              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  171

    8795                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    8796                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    8797              
    8798              $C$DW$T$204     .dwtag  DW_TAG_typedef
    8799                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    8800                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    8801                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    8802              
    8803              $C$DW$969       .dwtag  DW_TAG_TI_far_type
    8804                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$204)
    8805              
    8806              $C$DW$T$250     .dwtag  DW_TAG_const_type
    8807                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$969)
    8808              
    8809              
    8810              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8811                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    8812                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    8813              $C$DW$970       .dwtag  DW_TAG_member
    8814                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$26)
    8815                      .dwattr $C$DW$970, DW_AT_name("rsvd")
    8816                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_rsvd")
    8817                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8818                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    8819              
    8820              $C$DW$971       .dwtag  DW_TAG_member
    8821                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$79)
    8822                      .dwattr $C$DW$971, DW_AT_name("targetProc")
    8823                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_targetProc")
    8824                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8825                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    8826              
    8827              $C$DW$972       .dwtag  DW_TAG_member
    8828                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$26)
    8829                      .dwattr $C$DW$972, DW_AT_name("major")
    8830                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_major")
    8831                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8832                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    8833              
    8834              $C$DW$973       .dwtag  DW_TAG_member
    8835                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$26)
    8836                      .dwattr $C$DW$973, DW_AT_name("minor")
    8837                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_minor")
    8838                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8839                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    8840              
    8841                      .dwendtag $C$DW$T$80
    8842              
    8843              $C$DW$T$42      .dwtag  DW_TAG_typedef
    8844                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    8845                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    8846                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    8847              
    8848              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    8849                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  172

    8850                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    8851              
    8852              
    8853              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    8854                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    8855                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    8856              $C$DW$974       .dwtag  DW_TAG_member
    8857                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$82)
    8858                      .dwattr $C$DW$974, DW_AT_name("spiHandle")
    8859                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_spiHandle")
    8860                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8861                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    8862              
    8863              $C$DW$975       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$84)
    8865                      .dwattr $C$DW$975, DW_AT_name("gpioHandle")
    8866                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_gpioHandle")
    8867                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8868                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8869              
    8870              $C$DW$976       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$86)
    8872                      .dwattr $C$DW$976, DW_AT_name("gpioNumber")
    8873                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_gpioNumber")
    8874                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8875                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8876              
    8877              $C$DW$977       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$76)
    8879                      .dwattr $C$DW$977, DW_AT_name("RxTimeOut")
    8880                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_RxTimeOut")
    8881                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8882                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8883              
    8884              $C$DW$978       .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$76)
    8886                      .dwattr $C$DW$978, DW_AT_name("enableTimeOut")
    8887                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_enableTimeOut")
    8888                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8889                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8890              
    8891                      .dwendtag $C$DW$T$87
    8892              
    8893              $C$DW$T$156     .dwtag  DW_TAG_typedef
    8894                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    8895                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    8896                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    8897              
    8898              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    8899                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    8900                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    8901              
    8902              $C$DW$T$155     .dwtag  DW_TAG_typedef
    8903                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    8904                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  173

    8905                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    8906              
    8907              
    8908              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    8909                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    8910                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    8911              $C$DW$979       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$89)
    8913                      .dwattr $C$DW$979, DW_AT_name("DRV8301_CURRENT")
    8914                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    8915                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8916                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$980       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$91)
    8920                      .dwattr $C$DW$980, DW_AT_name("DRV8301_RESET")
    8921                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_DRV8301_RESET")
    8922                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8923                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$981       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$93)
    8927                      .dwattr $C$DW$981, DW_AT_name("PWM_MODE")
    8928                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_PWM_MODE")
    8929                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8930                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932              $C$DW$982       .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$95)
    8934                      .dwattr $C$DW$982, DW_AT_name("OC_MODE")
    8935                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_OC_MODE")
    8936                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8937                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8938              
    8939              $C$DW$983       .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$97)
    8941                      .dwattr $C$DW$983, DW_AT_name("OC_ADJ_SET")
    8942                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    8943                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8944                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8945              
    8946                      .dwendtag $C$DW$T$98
    8947              
    8948              $C$DW$T$112     .dwtag  DW_TAG_typedef
    8949                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    8950                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    8951                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    8952              
    8953              
    8954              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    8955                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    8956                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    8957              $C$DW$984       .dwtag  DW_TAG_member
    8958                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$100)
    8959                      .dwattr $C$DW$984, DW_AT_name("OCTW_SET")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  174

    8960                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_OCTW_SET")
    8961                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8962                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8963              
    8964              $C$DW$985       .dwtag  DW_TAG_member
    8965                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$102)
    8966                      .dwattr $C$DW$985, DW_AT_name("GAIN")
    8967                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_GAIN")
    8968                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8969                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8970              
    8971              $C$DW$986       .dwtag  DW_TAG_member
    8972                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$104)
    8973                      .dwattr $C$DW$986, DW_AT_name("DC_CAL_CH1p2")
    8974                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    8975                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8976                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    8977              
    8978              $C$DW$987       .dwtag  DW_TAG_member
    8979                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$106)
    8980                      .dwattr $C$DW$987, DW_AT_name("OC_TOFF")
    8981                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_OC_TOFF")
    8982                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8983                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8984              
    8985                      .dwendtag $C$DW$T$107
    8986              
    8987              $C$DW$T$113     .dwtag  DW_TAG_typedef
    8988                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    8989                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    8990                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    8991              
    8992              
    8993              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    8994                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    8995                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    8996              $C$DW$988       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$76)
    8998                      .dwattr $C$DW$988, DW_AT_name("FAULT")
    8999                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_FAULT")
    9000                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9001                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$989       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$76)
    9005                      .dwattr $C$DW$989, DW_AT_name("GVDD_UV")
    9006                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_GVDD_UV")
    9007                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9008                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$990       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$76)
    9012                      .dwattr $C$DW$990, DW_AT_name("PVDD_UV")
    9013                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_PVDD_UV")
    9014                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  175

    9015                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$991       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$76)
    9019                      .dwattr $C$DW$991, DW_AT_name("OTSD")
    9020                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_OTSD")
    9021                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9022                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$992       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$76)
    9026                      .dwattr $C$DW$992, DW_AT_name("OTW")
    9027                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_OTW")
    9028                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9029                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$993       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$76)
    9033                      .dwattr $C$DW$993, DW_AT_name("FETHA_OC")
    9034                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_FETHA_OC")
    9035                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9036                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$994       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$76)
    9040                      .dwattr $C$DW$994, DW_AT_name("FETLA_OC")
    9041                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_FETLA_OC")
    9042                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9043                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9044              
    9045              $C$DW$995       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$76)
    9047                      .dwattr $C$DW$995, DW_AT_name("FETHB_OC")
    9048                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_FETHB_OC")
    9049                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9050                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9051              
    9052              $C$DW$996       .dwtag  DW_TAG_member
    9053                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$76)
    9054                      .dwattr $C$DW$996, DW_AT_name("FETLB_OC")
    9055                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_FETLB_OC")
    9056                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9057                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9058              
    9059              $C$DW$997       .dwtag  DW_TAG_member
    9060                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$76)
    9061                      .dwattr $C$DW$997, DW_AT_name("FETHC_OC")
    9062                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_FETHC_OC")
    9063                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9064                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9065              
    9066              $C$DW$998       .dwtag  DW_TAG_member
    9067                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$76)
    9068                      .dwattr $C$DW$998, DW_AT_name("FETLC_OC")
    9069                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_FETLC_OC")
TMS320C2000 Assembler Unix v22.6.0 Thu Sep 21 22:05:22 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
/var/tmp/TIosEFUkbGj                                                 PAGE  176

